"use strict"

let sait = prompt("Выберите тип сайта: 0)LANDING PAGE (ОДНОСТРАНИЧНЫЙ САЙТ), 1)САЙТ-ВИЗИТКА, 2)КОРПОРАТИВНЫЕ САЙТЫ, 3)ПРОМО-САЙТЫ");
let design = prompt("Выберите дизайн сайта: 0)МИНИМАЛИЗМ, 1)КРАСИВАЯ ТИПОГРАФИКА, 2)КЛАССИЧЕСКИЙ СТИЛЬ, 3)КОРПОРАТИВНЫЙ СТИЛЬ");
let adaptability = prompt("Выберите адаптивность сайта : 0)Не адаптивный, 1)Адаптивный");

let mass=[
    sait,
    design,
    adaptability,
];
if ((mass[0] === "0") && (mass[1] === "0") && (mass[2] === "0")){
    alert("Сроки : 4-5 дней");
    alert("Стоймость : 15000 рублей");
}
else if((mass[0] === "0") && (mass[1] === "0") && (mass[2] === "1")){
    alert("Сроки : от 5 рабочих дней");
    alert("Стоймость : 17000 рублей");
}
else if((mass[0] === "1") && (mass[1] === "0") && (mass[2] === "0")){
    alert("Сроки : от 4 рабочих дней");
    alert("Стоймость : 16000 рублей");
}else if((mass[0] === "2") && (mass[1] === "0") && (mass[2] === "0")){
    alert("Сроки : от 7 рабочих дней");
    alert("Стоймость : 25000 рублей");
}
else if((mass[0] === "3") && (mass[1] === "0") && (mass[2] === "0")){
    alert("Сроки : от 5 рабочих дней");
    alert("Стоймость : 18000 рублей");
}
else if((mass[0] === "0") && (mass[1] === "1") && (mass[2] === "0")){
    alert("Сроки : от 3 рабочих дней");
    alert("Стоймость : 17000 рублей");
}
else if((mass[0] === "0") && (mass[1] === "2") && (mass[2] === "0")){
    alert("Сроки : от 5 рабочих дней");
    alert("Стоймость : 19000 рублей");
}
else if((mass[0] === "0") && (mass[1] === "3") && (mass[2] === "0")){
    alert("Сроки : от 5 рабочих дней");
    alert("Стоймость : 17000 рублей");
}
else if((mass[0] === "1") && (mass[1] === "1") && (mass[2] === "0")){
    alert("Сроки : от 5 рабочих дней");
    alert("Стоймость : 17000 рублей");
}
else if((mass[0] === "2") && (mass[1] === "1") && (mass[2] === "0")){
    alert("Сроки : от 4 рабочих дней");
    alert("Стоймость : 17500 рублей");
}
else if((mass[0] === "3") && (mass[1] === "1") && (mass[2] === "0")){
    alert("Сроки : от 5 рабочих дней");
    alert("Стоймость : 20000 рублей");
}
else if((mass[0] === "1") && (mass[1] === "2") && (mass[2] === "0")){
    alert("Сроки : от 5 рабочих дней");
    alert("Стоймость : 19000 рублей");
}
else if((mass[0] === "2") && (mass[1] === "2") && (mass[2] === "0")){
    alert("Сроки : от 5 рабочих дней");
    alert("Стоймость : 23500 рублей");
}
else if((mass[0] === "3") && (mass[1] === "2") && (mass[2] === "0")){
    alert("Сроки : от 6 рабочих дней");
    alert("Стоймость : 22000 рублей");
}
else if((mass[0] === "1") && (mass[1] === "3") && (mass[2] === "0")){
    alert("Сроки : от 6 рабочих дней");
    alert("Стоймость : 18000 рублей");
}
else if((mass[0] === "2") && (mass[1] === "3") && (mass[2] === "0")){
    alert("Сроки : от 5 рабочих дней");
    alert("Стоймость : 19500 рублей");
}
else if((mass[0] === "3") && (mass[1] === "3") && (mass[2] === "0")){
    alert("Сроки : от 7 рабочих дней");
    alert("Стоймость : 24000 рублей");
}
else if((mass[0] === "1") && (mass[1] === "1") && (mass[2] === "1")){
    alert("Сроки : от 6 рабочих дней");
    alert("Стоймость : 19000 рублей");
}
else if((mass[0] === "2") && (mass[1] === "1") && (mass[2] === "1")){
    alert("Сроки : от 5 рабочих дней");
    alert("Стоймость : 19500 рублей");
}
else if((mass[0] === "3") && (mass[1] === "1") && (mass[2] === "1")){
    alert("Сроки : от 6 рабочих дней");
    alert("Стоймость : 22000 рублей");
}
else if((mass[0] === "1") && (mass[1] === "2") && (mass[2] === "1")){
    alert("Сроки : от 5 рабочих дней");
    alert("Стоймость : 19000 рублей");
}
else if((mass[0] === "2") && (mass[1] === "2") && (mass[2] === "1")){
    alert("Сроки : от 6 рабочих дней");
    alert("Стоймость : 25500 рублей");
}
else if((mass[0] === "3") && (mass[1] === "2") && (mass[2] === "1")){
    alert("Сроки : от 7 рабочих дней");
    alert("Стоймость : 24000 рублей");
}
else if((mass[0] === "1") && (mass[1] === "3") && (mass[2] === "1")){
    alert("Сроки : от 7 рабочих дней");
    alert("Стоймость : 20000 рублей");
}
else if((mass[0] === "2") && (mass[1] === "3") && (mass[2] === "1")){
    alert("Сроки : от 6 рабочих дней");
    alert("Стоймость : 21500 рублей");
}
else if((mass[0] === "3") && (mass[1] === "3") && (mass[2] === "1")){
    alert("Сроки : от 8 рабочих дней");
    alert("Стоймость : 26000 рублей");
}
else{
    alert("Ошибка ввода,пожалуйста используйте цифры в обозначении")
};
